package org.dreaman.society.干支;

public class 年上起月表 {
    private static 天干[][] 年上起月表_月干 = {// 
    { 天干.丙, 天干.戊, 天干.庚, 天干.壬, 天干.甲 }, // 
            { 天干.丁, 天干.己, 天干.辛, 天干.癸, 天干.乙 }, //
            { 天干.戊, 天干.庚, 天干.壬, 天干.甲, 天干.丙 }, //
            { 天干.己, 天干.辛, 天干.癸, 天干.乙, 天干.丁 }, //
            { 天干.庚, 天干.壬, 天干.甲, 天干.丙, 天干.戊 }, // 
            { 天干.辛, 天干.癸, 天干.乙, 天干.丁, 天干.己 }, //
            { 天干.壬, 天干.甲, 天干.丙, 天干.戊, 天干.庚 }, //
            { 天干.癸, 天干.乙, 天干.丁, 天干.己, 天干.辛 }, //
            { 天干.甲, 天干.丙, 天干.戊, 天干.庚, 天干.壬 }, //
            { 天干.乙, 天干.丁, 天干.己, 天干.辛, 天干.癸 }, //
            { 天干.丙, 天干.戊, 天干.庚, 天干.壬, 天干.甲 }, //
            { 天干.丁, 天干.己, 天干.辛, 天干.癸, 天干.乙 } // 
    };

    private static 地支[] 年上起月表_月支 = { 地支.寅, 地支.卯, 地支.辰, 地支.巳, 地支.午, 地支.未, 地支.申, 地支.酉, 地支.戌, 地支.亥, 地支.子, 地支.丑 };

    public static 天干 起月干(天干 年干, 月份 月) {
        return 年上起月表_月干[月.ordinal()][年干.ordinal()];
    }

    public static 地支 起月支(月份 月) {
        return 年上起月表_月支[月.ordinal()];
    }
}
